Celebrity/app/views/users/show.html.erb

<script>
$('#user_tags').keyup(function() {
  var text_field_obj = $('#tag-submit').parent('.edit_user').find('#user_tags');
  var words = text_field_obj.val();
  if(words.length >= 1 && words.length <= 20){
    $("#tag-submit").prop("disabled", false);
  }else{
    $("#tag-submit").prop("disabled", true);
  }
});
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

<% if current_user.try(:admin) == true %>
<% elsif Feedback.where(user_id: current_user).count ==
  Movie.where(movie_category_id: MovieCategory.where(must_view: true).ids).count &&
  current_user.html_css_status.schedule_date.blank? ||
  current_user.javascript_status.schedule_date.blank? ||
  current_user.ruby_status.schedule_date.blank? ||
  current_user.rubyonrails_status.schedule_date.blank? ||
  current_user.railstutorial_status.schedule_date.blank? %>
---
SELECT  "html_css_statuses".* FROM "html_css_statuses" WHERE "html_css_statuses"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "javascript_statuses".* FROM "javascript_statuses" WHERE "javascript_statuses"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "railstutorial_statuses".* FROM "railstutorial_statuses" WHERE "railstutorial_statuses"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "ruby_statuses".* FROM "ruby_statuses" WHERE "ruby_statuses"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]