Celebrity/app/controllers/users_controller.rb

  def index
    if @current_user.admin
      @users = User.page(params[:page]).reorder('created_at DESC')
    else
      @users = User.where(id: @current_user.id).page(params[:page])
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" ASC
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."created_at" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.try(:guest)
      @user.save
---
INSERT INTO "users" ("name", "nickname", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"