Celebrity/Celebrity/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."created_at" ASC LIMIT $2  [["email", "zabiisann@gmail.com"], ["LIMIT", 1]]